OpenNuvoton/M031BSP/SampleCode/ISP/ISP_MSC/M031Series_User.h
#define GET_BYTE0(u32Param)    (((u32Param) & BYTE0_Msk)      ) /*!< Extract Byte 0 (Bit  0~ 7) from parameter u32Param */
#define GET_BYTE1(u32Param)    (((u32Param) & BYTE1_Msk) >>  8) /*!< Extract Byte 1 (Bit  8~15) from parameter u32Param */
#define GET_BYTE2(u32Param)    (((u32Param) & BYTE2_Msk) >> 16) /*!< Extract Byte 2 (Bit 16~23) from parameter u32Param */
#define GET_BYTE3(u32Param)    (((u32Param) & BYTE3_Msk) >> 24) /*!< Extract Byte 3 (Bit 24~31) from parameter u32Param */

/* Chip Series number definitions */
#define GET_CHIP_SERIES_NUM    ((SYS->PDID & 0xF00) >> 8)       /*!< Extract chip series number from PDID */
#define CHIP_SERIES_NUM_B      (0xBUL)                          /*!< Chip series number for M031_B */
#define CHIP_SERIES_NUM_C      (0xCUL)                          /*!< Chip series number for M031_C */
#define CHIP_SERIES_NUM_D      (0xDUL)                          /*!< Chip series number for M031_D */
#define CHIP_SERIES_NUM_E      (0xEUL)                          /*!< Chip series number for M031_E */
#define CHIP_SERIES_NUM_G      (0x6UL)                          /*!< Chip series number for M031_G */
#define CHIP_SERIES_NUM_I      (0x1UL)                          /*!< Chip series number for M031_I */

/*@}*/ /* end of group Legacy_Constants */

/******************************************************************************/
/*                         Peripheral header files                            */
/******************************************************************************/
#include "sys.h"
#include "clk_User.h"
#include "acmp.h"
#include "adc.h"
#include "crc.h"
#include "ebi.h"
#include "fmc.h"
#include "gpio.h"
#include "i2c.h"
#include "pdma.h"
#include "pwm.h"
#include "bpwm.h"
#include "qspi.h"
#include "spi.h"
#include "rtc.h"
#include "hdiv.h"
#include "timer.h"
#include "uart.h"
#include "usbd_User.h"
#include "usci_i2c.h"
#include "usci_spi.h"
#include "usci_uart.h"
#include "wdt.h"
#include "wwdt.h"

#endif  // __M031SERIES_H__

/*** (C) COPYRIGHT 2021 Nuvoton Technology Corp. ***/
